# однострочный комментарий 

# "Ctrl=/" - сочетание клавиши для создания или удаления однострочного комментария

'''
многострочный 
комментарий
'''

"""
 это тоже
 многострочный
 комментарий
"""

# *** Переменные ***

# snake_case (змеиная_нотация)
var_1 = 10
number_of_apples = 100

# camelCase (верблюжаяНотация)
myNumVar = 20

# Константные переменные (константа)
CONST_VAR = 1000


# встроенная функция вывода в терминал
# print(var_1)
# print(myNumVar)

# print(myNumVar, CONST_VAR, number_of_apples)

# встроеная функция ввода из терминала 
# in_1 = input("введите число: ")
# print(in_1)

# небольшой калькулятор
in_1 = input("введите 1 число: ")
in_2 = input("введите 2 число: ")

# конкатенация (объединени) строк
# result = in_1 + in_2

# сложение чисел
result = int(in_1) + int(in_2)

print(result)