# оперция сравнения 

x = -3
y = 3

# оперция "меньше"
# мы спрашиваем "значение x меньше значения y?"
res = x < y 

# операция "меньше либо равно" 
# мы спрашиваем "значение x меньше или равно значение y?"
res = x <= y 

# оперция "больше"
# мы спрашиваем "значение x больше значения y?"
res = x > y 

# операция "больше либо равно" 
# мы спрашиваем "значение x больше или равно значение y?"
res = x >= y 

# операция равенства (равно)
# мы спрашиваем "значение x равно значения y?"
res = x == y 

# операция НЕравенства ( не равно)
# мы спрашиваем "значение x НЕ равно значения y?"
res = x != y 

# print(res)

# логические операции 

v_1 = True
v_2 = False

# операция "НЕ" (NOT, инверция, отрицание)
res = not v_1

# операция "И" (AND, конъюкция, логическое умножение)
# возвращает True только тогда, когда оба значения True
res = v_1 and v_2

# операция "ИЛИ" (OR, дизъюкция, логическое сложение)
# возвращает False только тогда, когда оба значения False
res = v_1 or v_2

# print(res)

# отступы в python очень важны 
# по отступам интерпретатор ориентируется во вложенности кода


# условные операции (оператор)

a = 0

# оператор IF (если)
# if a == 0:
    # print("равно 0")

condition = a < 5

# if condition:
#     print("меньше 5")

# оператор Else (иначе)
a = 11 

# if a <= 10:
#     res = "Hello!"
# else:
#     res = "bye-bye!"

# print(res)

# оператор Elif (else if)
# не может существовать отдельно
# он должен идти после if, до else
a = 0

# if a > 0:
#     res = "больше нуля"
# elif a < 0:
#     res = "меньше нуля"
# else:
#     res = "равно нулю"


char = "a"


# if char == "A":
#     res = "буква A"
# elif char == "B":
#     res = "буква B"
# elif char == "C":
#     res = "буква C"
# else:
#      res = "другой символ"

# print(res)

# пример простого калькулятора 

value_1 = int(input("Введите 1 число: "))
value_2 = int(input("Введите 2 число: "))

operator = input("Введите операцию: ")

if operator == '+':
    result = value_1 + value_2
elif operator == '-':
    result = value_1 - value_2
elif operator == '*':
    result = value_1 * value_2
elif operator == '/':
    result = value_1 / value_2
else:
    result = "оператор не распознан :("

print(f"Результат = {result}")