# *** Коллекции ***

# Списки (list)

# Список - это упорядоченная (проиндексированная), изменяемая (мутабельная) коллекция

# объекты внутри списка - элементы
# каждый элемент проиндексирован

# создание пустого списка
lst_1 = []
lst_1 = list()

# создание предварительно заполненых списков
lst_2 = [10, 3, 100, 77]
lst_3 = [15, 52, 2.15, "python", 'A', [1,2,3]]
lst_4 = list("python")

# добавление элемента (объект) в список
# print(lst_3)

lst_1.append(100)
lst_1.append("Hello")
lst_1.append('$')

lst_3.append("привет")

# чтение значений элементов
# Прямая индексация (слева направо)
el_1 = lst_3[0]

# lenght = len(lst_3)
# last_el = lst_3[lenght - 1]

# обратная индексация (справо налево)
last_el = lst_3[-1]

# замена значений 
lst_3[1] = 654

# удаление элемента 
# по индексу
# del lst_3[-2]

# по значению
lst_3.remove(654)


# очистка списка
lst_3.clear()



# срезы списка 
lst_5 = list("Hello, world!")

# срез от начала до конца 
slice_1 = lst_5[0:13]
slice_1 = lst_5[:]


# срез от начала до индекса B (не включительно)
slice_1 = lst_5[:6]


# срез от индекса А до конца списка
slice_1 = lst_5[6:]

# срез от индекса А до индекса В (не включительно)
slice_1 = lst_5[5:9]


# срез от начала до конца с шагом 2
slice_1 = lst_5[::2]

#срез по отрицательным индексам и с отрицательным шагом

print(slice_1)